clc;clear;close all;

% [1] 王永娟,2009,基于高阶累积量的OFDM信号调制识别技术研究
% [2] 吕挺岑,2007,通信信号调制识别技术研究
% ===========================================================
% 针对OFDM信号相对于单载波信号对的识别
% 文献[1]中，3.2节介绍了基于偶数阶累积量的OFDM调制识别算法
% 基本思想是：由于OFDM信号的渐近高斯性，其四阶累积量为零。而单载波信号由于是非高斯的，其四阶累积量不为零。
% 下面针对这一个思想进行试验

load ofdmRx_data.mat %加载OFDM信号，这子信道是16QAM调制的。
y = ofdmRx_data;

%计算其四阶累积量C40,C41,C42
C40_ofdm = cum4x(y,y,y,y,0,128,0,'biased',0,0); %-3.3e-6
C41_ofdm = cum4x(y,y,y,conj(y),0,128,0,'biased',0,0); %-3.3e-6
C42_ofdm = cum4x(y,y,conj(y),conj(y),0,128,0,'biased',0,0); %-3.3e-6

%结果很接近0，下面还要的通过多次的MonteCarlo试验求均值，然后再算(ex2)

